Hello,

it looks like there are multiple things mixed together in this issue.

There a two different reasons why terraform might want to replace a VM (or any other resource).

1. Resource can be 'tainted'.

That means that its creation was not successfuly completed.
In plan it can be seen as "is tainted, so must be replaced", e.g:

```
  # proxmox_virtual_environment_vm.vm_test is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm_test" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
```

Because terraform HTTP API does not provide all operations needed, this provider also uses SSH.
When VM configured with disks using `file_id` argument, the VM is first created using HTTP API,
then using SSH the provider copies the disk image and attaches it.

If the SSH part fails (e.g. because SSH is not configured, does not work, etc...) the VM is not in a good known state,
next time terraform is run, it sees it as tainted and correctly wants to recreate it.

*Stopping terraform using Ctrl-C or failing provisioner can leave behind tainted resources*

2. Resource description changed in a way which requires complete replacement.

E.g. adding `clone.vm_id` argument to VM clearly requires VM to be replaced. There is no reasonable way to modify existing VM to match the new resource description.

In plan it can be seen as "must be replaced" with comments "# forces replacement" after arguments which force that replacement, e.g:

```
  # proxmox_virtual_environment_vm.vm_test must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm_test" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)

...

     + clone {
          + full    = true # forces replacement
          + retries = 1 # forces replacement
          + vm_id   = 1234 # forces replacement
        }

```

The problem is, that at the moment, many operations modifying VM's disk force VM replacement (see #103), some of those operations should not require VM replacement.

It is a bit tricky issue, because Proxmox API **does not have a stable ID** for a disk.
Moving disk `local-zfs:vm-102-disk-3` (datastore `local-zfs`, path_in_datastore `vm-102-disk-3`) to datastore `another-zfs` causes automatic change of path_in_datastore to `vm-102-disk-0` (assuming that there are no other disks of VM 102 in `another-zfs`). The disk number at the end of path_in_datastore is _not_ stable!
Using `interface` argument as stable id is also problematic, as users might want to switch between e.g. scsi and virtio.

It probably should be possible to not-require VM replacement when adding disks.

Supporting removing disks from VM without VM replacement would likely require stable disk identifier, maybe auto-genrating 'serial' argument of the disk (at the moment, it looks like the provider does not use this part of proxmox API).

@Xel-Naha The plan shows resources which are tainted, which suggest that their creation did not finish. Is it possible that provisioner failed to run ? (I use mostly VMs, so have no experience with `proxmox_virtual_environment_container` failure modes)

@M0NsTeRRR The linked terraform configuration uses `bios = "ovmf"` and
```
initialization {
    interface            = "ide2"
```

This will result in a configuration when cloud-init does not reliably find the configuration data. Use `interface = "scsi1"` or similar, details [here](https://github.com/bpg/terraform-provider-proxmox/issues/736#issuecomment-1823890195).

That alone should not cause VM to be tainted, but combined with
```
agent {
    enabled = true
}
```
The provider waits for qemu-guest-agent to run, and for VM get at least one reasonable IP address.
Without the cloud init, the static address is not set. Assuming that terraform either times out or is stopped using Ctrl-C, it would explain the tainted resources.

Also note that qemu-guest-agent is not installed by default in most cloud images, it can be installed and *started* [during](https://gist.github.com/otopetrik/f6e6ef79636592cab957407da1ac5f7b) cloud-init. Looking at the linked configuration it looks like you are using custom packer-build image with qemu-guest-agent baked in, so that should not be the problem.

@lazywebm Importing existing resources is relatively recent part of the provider. I think it badly interacts with the default value  `file_format = "qcow2"` somewhere. Depending on your risk tolerance, manually changing  `file_format` value in `terraform.tfstate` file to `raw` might be a workaround. Then it should be possible to remove `disks` from ignore changes. Probably the only reason to do that would be to gain the ability to increase VM disks sizes from terraform configuration.